app/views/welcome/index.html.erb

SELECT COUNT(comments) FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 4]]
---
    <p class="article-body"><%= article.body %></p>
    <% if article.comments.count == 1 %>