app/controllers/articles_controller.rb

  def show
    @article = Article.find_by(id: params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", 1]]