app/controllers/comments_controller.rb

  def new
    @comment = Comment.new
    @article = Article.find_by(id: [:article_id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = NULL LIMIT 1