app/controllers/welcome_controller.rb

  def index
    @articles = Article.all.order('created_at DESC')
---
SELECT "articles".* FROM "articles"  ORDER BY created_at DESC